app/Views/layout/navbar.php

        $productModel = new \App\Models\ProductModel();

        foreach ($cartSession as $item) {
            $product = $productModel->find($item['product_id']);
---
SELECT *
FROM `products`
WHERE `products`.`id` = '34'