app/Controllers/AdminController.php

    public function dashboard()
    {
        $productModel = new \App\Models\ProductModel();
        $eventModel = new \App\Models\EventModel();

        // Get chart data
        $userGrowthData = $this->getUserGrowthData();
        $artworksGrowthData = $this->getArtworksGrowthData();
        $rejectedArtworks = $productModel
            ->join('users', 'users.id = products.artist_id')
            ->where('users.is_artist', 1)
            ->where('products.is_approved', 2)
            ->countAllResults();

        // Calculate additional statistics
        $total_users = $this->userModel->countAll();
        $total_artists = $this->userModel->where('is_artist', 1)->countAllResults();
        $approved_artists = $this->userModel
            ->where('is_artist', 1)
            ->where('artist_profile_approved', 1)
            ->countAllResults();
        $total_artworks = $productModel
            ->join('users', 'users.id = products.artist_id')
            ->where('users.is_artist', 1)
            ->countAllResults();
        $approved_artworks = $productModel
            ->join('users', 'users.id = products.artist_id')
            ->where('users.is_artist', 1)
            ->where('products.is_approved', 1)
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `products`
JOIN `users` ON `users`.`id` = `products`.`artist_id`
WHERE `users`.`is_artist` = 1
AND `products`.`is_approved` = 2
SELECT COUNT(*) AS `numrows` FROM `users`
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `is_artist` = 1
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `is_artist` = 1
AND `artist_profile_approved` = 1
SELECT COUNT(*) AS `numrows`
FROM `products`
JOIN `users` ON `users`.`id` = `products`.`artist_id`
WHERE `users`.`is_artist` = 1
SELECT COUNT(*) AS `numrows`
FROM `products`
JOIN `users` ON `users`.`id` = `products`.`artist_id`
WHERE `users`.`is_artist` = 1
AND `products`.`is_approved` = 1


        // Calculate new users this month
        $current_month = date('Y-m');
        $new_users_month = $this->userModel
            ->where('created_at >=', $current_month . '-01')
            ->where('created_at <=', date('Y-m-t') . ' 23:59:59')
            ->countAllResults();

        // Get total events count dynamically
        $total_events = $eventModel->where('is_active', 1)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `created_at` >= '2025-06-01'
AND `created_at` <= '2025-06-30 23:59:59'
SELECT COUNT(*) AS `numrows`
FROM `events`
WHERE `is_active` = 1

        $data = [
            'total_users' => $total_users,
            'total_artists' => $total_artists,
            'pending_approvals' => $this->userModel
                ->where('is_artist', 1)
                ->where('artist_profile_approved', 0)
                ->countAllResults(),
            'approved_artists' => $approved_artists,
            'total_artworks' => $total_artworks,
            'approved_artworks' => $approved_artworks,
            'pending_artworks' => $productModel
                ->join('users', 'users.id = products.artist_id')
                ->where('users.is_artist', 1)
                ->where('products.is_approved', 0)
                ->countAllResults(),
---
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `is_artist` = 1
AND `artist_profile_approved` = 0
SELECT COUNT(*) AS `numrows`
FROM `products`
JOIN `users` ON `users`.`id` = `products`.`artist_id`
WHERE `users`.`is_artist` = 1
AND `products`.`is_approved` = 0

    private function getUserGrowthData()
    {
        $data = [];
        $months = [];

        for ($i = 5; $i >= 0; $i--) {
            $date = date('Y-m', strtotime("-$i months"));
            $months[] = date('M', strtotime("-$i months"));

            $startDate = $date . '-01';
            $endDate = date('Y-m-t', strtotime($startDate));

            $count = $this->userModel
                ->where('created_at >=', $startDate)
                ->where('created_at <=', $endDate . ' 23:59:59')
                ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `created_at` >= '2025-01-01'
AND `created_at` <= '2025-01-31 23:59:59'

    private function getArtworksGrowthData()
    {
        $productModel = new \App\Models\ProductModel();
        $data = [];

        for ($i = 5; $i >= 0; $i--) {
            $date = date('Y-m', strtotime("-$i months"));

            $startDate = $date . '-01';
            $endDate = date('Y-m-t', strtotime($startDate));

            $count = $productModel
                ->join('users', 'users.id = products.artist_id')
                ->where('users.is_artist', 1)
                ->where('products.created_at >=', $startDate)
                ->where('products.created_at <=', $endDate . ' 23:59:59')
                ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `products`
JOIN `users` ON `users`.`id` = `products`.`artist_id`
WHERE `users`.`is_artist` = 1
AND `products`.`created_at` >= '2025-01-01'
AND `products`.`created_at` <= '2025-01-31 23:59:59'

    public function users()
    {
        $users = $this->userModel->findAll();
---
SELECT *
FROM `users`

    public function artists()
    {
        $artists = $this->userModel
            ->where('is_artist', 1)
            ->findAll();
---
SELECT *
FROM `users`
WHERE `is_artist` = 1