app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'admin'
OR `username` = 'admin'
 LIMIT 1
---
        }

        // Cari user
        $user = $userModel->where('email', $emailOrUsername)
                         ->orWhere('username', $emailOrUsername)
                         ->first();