app/Controllers/CartController.php

    public function checkout()
    {
        $cartItems = $this->session->get('cart') ?? [];

        foreach ($cartItems as &$item) {
            $product = $this->productModel->find($item['product_id']);

            $item['product_title'] = $product['title'] ?? 'Unknown Product';

            // Get size description
            if (!empty($item['size_id'])) {
                $productSize = $this->sizeModel->find($item['size_id']);
                if ($productSize) {
                    $masterSize = (new \App\Models\MasterSizeModel())->find($productSize['master_size_id']);
                    $item['size_description'] = $masterSize['size_description'] ?? 'Unknown Size';
                }
            } else {
                $item['size_description'] = 'No Size';
            }

            // Get frame name
            if (!empty($item['frame_id'])) {
                $productFrame = $this->frameModel->find($item['frame_id']);
                if ($productFrame) {
                    $masterFrame = (new \App\Models\MasterFrameModel())->find($productFrame['master_frame_id']);
---
SELECT *
FROM `products`
WHERE `products`.`id` = '34'
SELECT *
FROM `master_sizes`
WHERE `master_sizes`.`id` = '1'
SELECT *
FROM `master_frames`
WHERE `master_frames`.`id` = '1'