app/Controllers/CheckoutController.php

    public function orderHistory()
    {
        // Pastikan user sudah login
        if (!$this->session->has('user_id')) {
            return redirect()->to('xplorea/login')->with('error', 'Please login to view order history');
        }

        $userId = $this->session->get('user_id');

        // Ambil semua order user
        $orders = $this->ordersModel
            ->where('user_id', $userId)
            ->orderBy('created_at', 'DESC')
            ->findAll();

        // Ambil detail items untuk setiap order
        foreach ($orders as &$order) {
            $orderItems = $this->orderItemsModel
                ->select('order_items.*, products.title, products.image_url, master_sizes.size_description, master_frames.frame_name')
                ->join('products', 'products.id = order_items.product_id', 'left')
                ->join('master_sizes', 'master_sizes.id = (SELECT master_size_id FROM product_sizes WHERE id = order_items.size_id)', 'left')
                ->join('master_frames', 'master_frames.id = (SELECT master_frame_id FROM product_frames WHERE id = order_items.frame_id)', 'left')
                ->where('order_id', $order['id'])
                ->findAll();
---
SELECT *
FROM `orders`
WHERE `user_id` = '19'
ORDER BY `created_at` DESC
SELECT `order_items`.*, `products`.`title`, `products`.`image_url`, `master_sizes`.`size_description`, `master_frames`.`frame_name`
FROM `order_items`
LEFT JOIN `products` ON `products`.`id` = `order_items`.`product_id`
LEFT JOIN `master_sizes` ON `master_sizes`.`id` = (SELECT master_size_id FROM product_sizes WHERE id = order_items.size_id)
LEFT JOIN `master_frames` ON `master_frames`.`id` = (SELECT master_frame_id FROM product_frames WHERE id = order_items.frame_id)
WHERE `order_id` = '12'