app/Controllers/EventController.php

INSERT INTO `events` (`title`, `description`, `location`, `start_datetime`, `end_datetime`, `max_attendees`, `image_url`, `created_by`, `created_at`, `updated_at`) VALUES ('event#1', 'first event', 'Unram', '2025-07-04T10:59', '2025-07-05T10:59', '10000', '1751338787_801f8ccd04782bc51f9d.jpg', '30', '2025-07-01 02:59:47', '2025-07-01 02:59:47')
---
            'created_by' => session()->get('user_id')
        ];

        if ($this->eventModel->save($eventData)) {

SELECT *
FROM `events`
WHERE `id` = '10'
AND `created_by` = '30'
 LIMIT 1
---
    public function edit($id)
    {
        $artistId = session()->get('user_id');
        $event = $this->eventModel->where(['id' => $id, 'created_by' => $artistId])->first();

SELECT *
FROM `events`
WHERE `id` = '10'
AND `created_by` = '30'
 LIMIT 1
DELETE FROM `events`
WHERE `id` IN ('10')
---
    public function delete($id)
    {
        $artistId = session()->get('user_id');
        $event = $this->eventModel->where(['id' => $id, 'created_by' => $artistId])->first();

        if (!$event) {
            return redirect()->to('artist/events')->with('error', 'Event not found');
        }

        // Check if event has attendees
        $attendees = $this->attendeeModel->where('event_id', $id)->countAllResults();
        if ($attendees > 0) {
            return redirect()->to('artist/events')->with('error', 'Cannot delete event with existing attendees');
        }

        if ($this->eventModel->delete($id)) {

SELECT `event_attendees`.*, `users`.`fullname`, `users`.`email`, `event_tickets`.`price`, `event_tickets`.`ticket_type`
FROM `event_attendees`
JOIN `users` ON `users`.`id` = `event_attendees`.`user_id`
JOIN `event_tickets` ON `event_tickets`.`id` = `event_attendees`.`ticket_id`
WHERE `event_attendees`.`event_id` = '4'
SELECT *
FROM `events`
WHERE `events`.`id` = '4'
---
    public function attendees($eventId)
    {
        $builder = $this->db->table('event_attendees');
        $builder->select('event_attendees.*, users.fullname, users.email, event_tickets.price, event_tickets.ticket_type');
        $builder->join('users', 'users.id = event_attendees.user_id');
        $builder->join('event_tickets', 'event_tickets.id = event_attendees.ticket_id');
        $builder->where('event_attendees.event_id', $eventId);
        $attendees = $builder->get()->getResultArray();

        $event = $this->eventModel->find($eventId);