app/Controllers/Xplorea.php

    public function index(): string
    {
        $eventModel = new \App\Models\EventModel();

        // Ambil event yang masih aktif untuk hero section
        $recentEvents = $eventModel
            ->where('is_active', true)  // Hanya event yang aktif
            ->where('start_datetime >=', date('Y-m-d H:i:s'))  // Event yang belum dimulai atau sedang berlangsung
            ->orderBy('start_datetime', 'ASC')  // Urutkan berdasarkan tanggal mulai terdekat
            ->limit(5)  // Batasi maksimal 5 event
            ->findAll();

        // Fetch latest artworks yang sudah disetujui
        $latestArtworks = $this->productModel
            ->where('is_approved', 1)
            ->orderBy('created_at', 'DESC')
            ->limit(3)
            ->findAll();

        // Fetch upcoming events within next 7 days for the banner
        $upcomingEvents = $eventModel
            ->where('is_active', true)
            ->where('start_datetime >=', date('Y-m-d H:i:s'))
            ->where('start_datetime <=', date('Y-m-d H:i:s', strtotime('+7 days')))
            ->orderBy('start_datetime', 'ASC')
            ->limit(3)
            ->findAll();

        // Fetch all upcoming events for calendar (next 3 months)
        $calendarEvents = $eventModel
            ->where('is_active', true)
            ->where('start_datetime >=', date('Y-m-d H:i:s'))
            ->where('start_datetime <=', date('Y-m-d H:i:s', strtotime('+3 months')))
            ->orderBy('start_datetime', 'ASC')
            ->findAll();
---
SELECT *
FROM `events`
WHERE `is_active` = 1
AND `start_datetime` >= '2025-06-23 14:58:54'
ORDER BY `start_datetime` ASC
 LIMIT 5
SELECT *
FROM `products`
WHERE `is_approved` = 1
ORDER BY `created_at` DESC
 LIMIT 3
SELECT *
FROM `events`
WHERE `is_active` = 1
AND `start_datetime` >= '2025-06-23 14:58:54'
AND `start_datetime` <= '2025-06-30 14:58:54'
ORDER BY `start_datetime` ASC
 LIMIT 3
SELECT *
FROM `events`
WHERE `is_active` = 1
AND `start_datetime` >= '2025-06-23 14:58:54'
AND `start_datetime` <= '2025-09-23 14:58:54'
ORDER BY `start_datetime` ASC

    public function marketplace()
    {
        // Ambil produk yang sudah disetujui (is_approved = 1)
        $products = $this->productModel
            ->select('products.*, users.username as artist_name')
            ->join('users', 'users.id = products.artist_id')
            ->where('products.is_approved', 1)
            ->where('users.is_artist', 1)
            ->where('users.artist_profile_approved', 1)
            ->orderBy('products.created_at', 'DESC')
            ->findAll();
---
SELECT `products`.*, `users`.`username` as `artist_name`
FROM `products`
JOIN `users` ON `users`.`id` = `products`.`artist_id`
WHERE `products`.`is_approved` = 1
AND `users`.`is_artist` = 1
AND `users`.`artist_profile_approved` = 1
ORDER BY `products`.`created_at` DESC