app/Models/EventTicketModel.php

    public function getTicketsByEvent($eventId)
    {
        return $this->where('event_id', $eventId)
            ->where('is_active', true)
            ->where('sale_start <=', date('Y-m-d H:i:s'))
            ->where('sale_end >=', date('Y-m-d H:i:s'))
            ->findAll();
---
SELECT *
FROM `event_tickets`
WHERE `event_id` = '11'
AND `is_active` = 1
AND `sale_start` <= '2025-07-01 02:59:54'
AND `sale_end` >= '2025-07-01 02:59:54'

    public function checkTicketAvailability($ticketId, $quantity = 1)
    {
        $ticket = $this->find($ticketId);
---
SELECT *
FROM `event_tickets`
WHERE `event_tickets`.`id` = '5'

    public function updateTicketQuantity($ticketId, $quantity)
    {
        return $this->set('quantity_available', "quantity_available - {$quantity}", false)
            ->where('id', $ticketId)
            ->update();
---
UPDATE `event_tickets` SET `quantity_available` = quantity_available - 5, `updated_at` = '2025-06-24 04:09:51'
WHERE `id` = '5'