app/Models/EventAttendeeModel.php

SELECT `event_attendees`.*, `events`.`title`, `events`.`start_datetime`, `events`.`location`, `event_tickets`.`ticket_type`, `event_tickets`.`price`
FROM `event_attendees`
LEFT JOIN `events` ON `events`.`id` = `event_attendees`.`event_id`
LEFT JOIN `event_tickets` ON `event_tickets`.`id` = `event_attendees`.`ticket_id`
WHERE `event_attendees`.`user_id` = '27'
ORDER BY `events`.`start_datetime` ASC
---
    public function getUserBookings($userId)
    {
        return $this->select('event_attendees.*, events.title, events.start_datetime, events.location, event_tickets.ticket_type, event_tickets.price')
            ->join('events', 'events.id = event_attendees.event_id', 'left')
            ->join('event_tickets', 'event_tickets.id = event_attendees.ticket_id', 'left')
            ->where('event_attendees.user_id', $userId)
            ->orderBy('events.start_datetime', 'ASC')
            ->findAll();

SELECT *
FROM `event_attendees`
WHERE `event_id` = '4'
AND `user_id` = '27'
AND `ticket_id` = '5'
 LIMIT 1
---
    public function checkUserBooking($eventId, $userId, $ticketId)
    {
        return $this->where('event_id', $eventId)
            ->where('user_id', $userId)
            ->where('ticket_id', $ticketId)
            ->first();