app/Models/EventModel.php

SELECT `events`.*, `users`.`username` as `creator_name`, `users`.`fullname` as `creator_fullname`
FROM `events`
LEFT JOIN `users` ON `users`.`id` = `events`.`created_by`
WHERE `events`.`is_active` = 1
ORDER BY `events`.`start_datetime` ASC
---
    public function getEventsWithCreator($limit = null, $offset = 0)
    {
        $builder = $this->select('events.*, users.username as creator_name, users.fullname as creator_fullname')
            ->join('users', 'users.id = events.created_by', 'left')
            ->where('events.is_active', true)
            ->orderBy('events.start_datetime', 'ASC');

        if ($limit) {
            $builder->limit($limit, $offset);
        }

        return $builder->findAll();

SELECT `events`.*, `users`.`username` as `creator_name`
FROM `events`
LEFT JOIN `users` ON `users`.`id` = `events`.`created_by`
WHERE `events`.`created_by` = '10'
ORDER BY `events`.`start_datetime` ASC
---
    public function getEventsByArtist($artistId)
    {
        return $this->select('events.*, users.username as creator_name')
            ->join('users', 'users.id = events.created_by', 'left')
            ->where('events.created_by', $artistId)
            ->orderBy('events.start_datetime', 'ASC')
            ->findAll();

SELECT `events`.*, `users`.`username` as `creator_name`
FROM `events`
LEFT JOIN `users` ON `users`.`id` = `events`.`created_by`
WHERE `events`.`is_active` = 1
AND `events`.`start_datetime` > '2025-07-01 02:59:50'
ORDER BY `events`.`start_datetime` ASC
 LIMIT 20
---
    public function getUpcomingEvents($limit = 10)
    {
        return $this->select('events.*, users.username as creator_name')
            ->join('users', 'users.id = events.created_by', 'left')
            ->where('events.is_active', true)
            ->where('events.start_datetime >', date('Y-m-d H:i:s'))
            ->orderBy('events.start_datetime', 'ASC')
            ->limit($limit)
            ->findAll();

SELECT `events`.*, `users`.`username` as `creator_name`, `users`.`fullname` as `creator_fullname`
FROM `events`
LEFT JOIN `users` ON `users`.`id` = `events`.`created_by`
WHERE `events`.`id` = '4'
AND `events`.`is_active` = 1
 LIMIT 1
---
    public function getEventWithDetails($eventId)
    {
        return $this->select('events.*, users.username as creator_name, users.fullname as creator_fullname')
            ->join('users', 'users.id = events.created_by', 'left')
            ->where('events.id', $eventId)
            ->where('events.is_active', true)
            ->first();